
## Plan Result

[CI link](https://github.com/goda6565/portfolio/actions/runs/15101900437)


<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger
  * module.cloudbuild_frontend_trigger.google_cloudbuildv2_repository.github_repository


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cloudbuild_frontend_trigger.google_cloudbuild_trigger.github_trigger will be created
  + resource "google_cloudbuild_trigger" "github_trigger" {
      + create_time        = (known after apply)
      + description        = "Build trigger for frontend"
      + filename           = "manifests/cloudbuild/frontend.yaml"
      + id                 = (known after apply)
      + include_build_logs = "INCLUDE_BUILD_LOGS_WITH_STATUS"
      + included_files     = [
          + "apps/frontend/**",
        ]
      + location           = "us-west2"
      + name               = "frontend-trigger"
      + project            = "portfolio-460206"
      + service_account    = "projects/portfolio-460206/serviceAccounts/cloudbuild-deployer@portfolio-460206.iam.gserviceaccount.com"
      + trigger_id         = (known after apply)

      + approval_config (known after apply)

      + github {
          + name  = "portfolio"
          + owner = "goda6565"

          + push {
              + branch = "^(main|feat/.*)$"
            }
        }
    }

  # module.cloudbuild_frontend_trigger.google_cloudbuildv2_repository.github_repository will be created
  + resource "google_cloudbuildv2_repository" "github_repository" {
      + create_time           = (known after apply)
      + effective_annotations = (known after apply)
      + etag                  = (known after apply)
      + id                    = (known after apply)
      + location              = (known after apply)
      + name                  = "portfolio"
      + parent_connection     = "projects/portfolio-460206/locations/asia-northeast1/connections/github-connection"
      + project               = "portfolio-460206"
      + remote_uri            = "https://github.com/goda6565/portfolio.git"
      + update_time           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label add-or-update: POST https://api.github.com/repos/goda6565/portfolio/issues/26/labels: 403 You do not have permission to create labels on this repository. [{Resource:Repository Field:label Code:unauthorized Message:}]
<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":26,"Program":"tfcmt","SHA1":"6ad711b927e5dcf6b67ae94946c4eb343b1097a2","Vars":{},"WorkflowName":"Terraform Multi-Env CI"} -->